
[
    {
        "id":0,
        "title":"Bitcoin Price and Ethereum Prediction: Can FOMC Meeting Minutes Boost The Cryptocurrency Market?",
        "desc":"Bitcoin, the world's largest cryptocurrency, has failed to maintain its upward momentum and has fallen below $24,000 in the last 24 hours, dropping from its peak of $25,100 due to a significant reversal in the cryptocurrency market. Following Bitcoin's lead, Ethereum has also seen a gradual decline in the past 24 hours. As the cryptocurrency market continues to experience volatility, all eyes are on the Federal Open Market Committee (FOMC) meeting minutes scheduled to be released today. The outcome of this event is expected to have a significant impact on the market, particularly on Bitcoin and Ethereum prices.<br></br> <h4>Cryptocurrency Market Analysis: A Fundamental Outlook</h4> <img src=https://m.foolcdn.com/media/dubs/images/original_imagesoriginal_imageshttpsg.foolcdn.c.width-880_SfbkM9V.jpg width=100% height=400></img> <br></br> The downward trend in the cryptocurrency market can be mainly attributed to the upcoming release of preliminary GDP data and PCE figures from the United States, which are expected to increase market volatility. <br></br> In addition, the upcoming release of the Federal Reserve's February meeting minutes is viewed as another factor causing investors to hesitate and contributing to Bitcoin's losses. The central bank is expected to deliver a hawkish stance in the Fed minutes, which is keeping cryptocurrency gains in check. Moreover, the previously released higher-than-expected US PMI has given the Fed additional economic headroom to hike interest rates, adding to the cautious sentiment in the crypto market. <br></br> <h4>Risk-Off Wave in the Crypto Market: Eyes on Key US Data</h4> <img src=https://www.diabetes.co.uk/wp-content/uploads/2022/10/usa.jpg width=100% height=400></img> <br></br> Despite the emergence of several positive regulations for the cryptocurrency market, the global cryptocurrency market has failed to sustain its upward trend and has turned negative for the day. This is likely due to cautious investor sentiment ahead of the Federal Reserve's February meeting minutes, as investors await more clarity on US interest rates and the path of monetary policy. In addition, the upcoming release of the Personal Consumption Expenditures Index is also expected to increase market volatility. It's worth noting that the Federal Reserve's February meeting minutes, which are set to be released later today, are widely expected to echo the central bank's hawkish tone. This means that the rising interest rates will limit liquidity, which is not good for cryptocurrencies. Higher yields typically lead investors to withdraw their money from riskier investments. ",
        "image":"https://v2.cimg.co/news/105619/258412/responsive-images/22___media_library_original_600_338.jpg",
        "date":"21 Feb 2023 23:29 GMT+3"
    },
    {
        "id":1,
        "title":"Shiba Inu Price Prediction as Shibarium Launch Approaches – $1 SHIB Incoming?",
         "desc":"Shiba Inu (SHIB) is on a make-or-break collision course with the 200-Day MA. Will SHIB burst or bounce ahead of the Shibarium launch? Markets are on edge as Shiba Inu (SHIB) begins a make-or-break test of steadfast 200-day MA. Could the launch of Shibarium save SHIB's fledging rally? Yesterday's analysis focused on the critical collision course between price levels and the rising 200-day MA. This follows a retracement pattern predicted last week following rejection at $0.00001500. <br></br> I can confirm the vital test of the 200-day MA is currently taking place. A bounce here could see Shibarium drive SHIB to new heights. With bull confidence boosted by the highly anticipated burn mechanism. This is now the ninth day of localized retracement, with prices currently trading astride the 200-day MA at $0.00001220. That marks a daily change of -2.17% as bulls continue to fight for support around $0.00001250. Attempted consolidation at this level over the weekend has found legs from the rising 200-day MA - highlighting the importance of this test. Price levels are still sat above more obvious local support at $0.00001150 - $0.00001200. <br></br> <h4>Shiba Inu (SHIB) On-Chain: Could Shiba Inu sell pressure be over?</h4> <br></br> Price action remains poised as traders sit waiting for a decisive signal from the make-or-break test. Looking at SHIB's indicators, signals are more clouded today. The RSI 14 shows increasing bullish divergence at 38.5 - as SHIB continues to move into oversold territory. Notably, the RSI hasn't topped out since February 4 - marking a 9-day cooldown on the RSI. This paints an interesting on-chain picture - illuminating the flow of SHIB off exchanges. Net Transfer Volume has steadily decreased throughout February. This follows a huge spike on January 9, which saw coins rushing onto exchanges ready to sell as prices rose. The sell-off likely occurred in the last week of January when prices met resistance at $0.00001500. <br></br> <img src=https://v2.cimg.co/news/104925/256977/responsive-images/shib-ntv___media_library_original_1800_1013.jpg width=100% height=auto></img> Most likely, this was profit-taking by long-term holders after a difficult crypto winter. Suggesting the worst of ongoing sell-pressure has passed - meaning a bounce off the 200 Day MA could see skyrocket velocity upwards. The bullish on-chain sentiment is reinforced when we look at the Balance of Exchanges. February has seen a -5.4% reduction in on-exchange balances of SHIB. This signals that supply is being accumulated and removed from exchanges, likely ahead of the Shibarium launch this week. A glance at the MACD shows -0.00000002 - the mildest bearish divergence. This is negligible, and reflects the support test astride the 200-Day MA.",
        "image":"https://v2.cimg.co/news/104925/256986/responsive-images/shibusdt-2023-02-13-09-27-17-overlay___media_library_original_1001_465.jpg",
        "date":"20 Feb 2023 22:14 GMT+3"
    },
    {
        "id":2,
        "title":"First NFT Exchange-Traded Fund Announces Closure as Market for Non-Fungible Tokens and Metaverse Assets Cool Down.",
        "desc":"The first-ever exchange-traded fund focused on NFTs and metaverse assets has announced closure as the crypto winter continues to claim more victims. The Defiance Digital Revolution ETF, which is listed on the NYSE under the ticker NFTZ, will close down by the end of February, according to a recent press release. The fund will begin liquidating its portfolio assets starting February 16, and won't accept orders for new creation units after that day. Prior to the Liquidation Date, shareholders may only be able to sell their shares to certain broker-dealers, and there is no assurance that there will be a market for the Fund’s shares during that time period, the announcement said. <br></br> Launched in December 2021, the fund is provided by Defiance ETFs and is built to track the BITA NFT and Blockchain Select Index, an index that tracks blockchain-related companies and non-fungible tokens. Shares in the fund are down by more than 72% since its debut. The fund's closure comes as the hype over NFTs and metaverse assets has cooled down dramatically over the past year amid the broader market downturn that has seen major cryptocurrencies like Bitcoin and Ethereum lose around 70% of their value compared to all-time highs. According to NFT experts at Casinos En Ligne, sales of non-fungible tokens saw a downfall of 83 percent year-over-year in 2022. Moreover, across all the markets, including art, gaming, and collectibles, NFT transaction volume plunged by at least 83 percent. <br></br> <img src=https://www.speakeragency.com.tr/media/h4shzgp0/387840464-690x460.jpg width=100% height=350></img> <br></br> The NFT space surged to an all-time high in January 2022 with monthly sales reaching $2.8 billion. However, that number saw a steep drop by earlier this year following a string of bankruptcies and implosions that saw around $2 trillion wiped out of the crypto market. Despite the bloodbath in the NFT market, a number of high-profile companies have announced plans to expand both into NFTs. Just recently, Amazon revealed that it plans to launch a “digital assets enterprise” focused on non-fungible tokens and Web3 gaming this spring. In November, a patent filing revealed Sony’s vision for a system that could be used to track the creation, use, and transfer of digital assets created within a game. The patent envisions a system for “creating, modifying, tracking, authenticating, and/or transferring unique digital assets” associated with video games. Furthermore, investment giant Fidelity also hinted at an intent to push deeper into cryptocurrencies and Web3 with three new trademarks filed in December last year. The filings have a focus on NFTs and virtual worlds like the Metaverse. ",
       "image":"https://v2.cimg.co/news/103410/254434/responsive-images/adobestock-rokas-1-media-library-original-1200-800___media_library_original_1200_800.jpeg",
       "date":"19 Feb 2023 20:24 GMT+3"
    },
    {
        "id":3,
        "title":"Is the Bitcoin Rally Running Out of Steam? Analysts Worry That This Key Metric Isn’t Improving",
        "desc":"As the Bitcoin (BTC) price continues to go sideways just below the $25,000 level, traders are trying to assess whether the world’s largest cryptocurrency by market capitalization has enough oomph to muster another breakout above key resistance. For the last five days, sell pressure ahead of the August 2022 highs in the low $25,000s has kept a lid on prices. <br></br> Technicians think that a break above this level and the May 2022 lows around $25,400 would open the door to a swift move higher to the next major resistance area around $28,000. But some traders are becoming concerned that this year’s Bitcoin rally (BTC is up close to 50%) may soon run out of steam. Indeed, an analyst at respected crypto analytics firm CryptoQuant recently expressed concern about one key on-chain that isn’t improving sufficiently to imply further BTC price upside. <br></br> <h4>Active Bitcoin Addresses Not Rising as Fast as Past Bull Markets</h4> According to Yonsei_dent, a contributor to CryptoQuant’s Quicktake blog, the number of active Bitcoin addresses are not increasing that much, unlike during past Bitcoin bull market cycles. “Active Addresses is a metric that includes all addresses sending and receiving BTC, providing a look at how active market demand is,” noted Yonsei-dent, explaining that this essentially means that market demand for Bitcoin hasn’t increased that much. According to data presented by crypto-analytics firm Glassnode, the most recent 30-day moving average of Bitcoin active addresses was around 954,000, only up around 50,000 since the start of the year, and still well within the 875,000-980,000ish range of the last 14 or so months. <img src=https://v2.cimg.co/news/105610/258338/responsive-images/glassnode-1___media_library_original_1800_1013.jpg width=100% height:auto></img> <br></br> Historically, sharp rallies in the Bitcoin price have coincided with sharp rises in the number of active addresses. Yongsei_dent points out the H1 2019 and post-pandemic 2020 to early 2021 rallies as examples of this. <br></br> <h4>Other On-chain Network Activity Metrics Paint a Better Picture</h4> The Bitcoin bulls will be relieved to know that plenty of other on-chain metrics that shed light on Bitcoin network activity paint a better picture. For starters, the 30-day moving average number of daily network transactions recently rose above 300,000 for the first time since April 2021, when Bitcoin’s price was around $60,000. This metric doesn’t have the best track record of correlating with Bitcoin price rallies, but it certainly isn’t a negative for BTC if transactions are rising. Elsewhere, the rate at which new Bitcoin wallet addresses interacting with the network for the first time is also accelerating. The 30-day exponential moving average recently surpassed 450,000 for the first time since May 2021. This metric has a much better history of correlating with increases in the Bitcoin price. <br></br> In their “Recovering from a Bitcoin Bear” dashboard of eight on-chain and technical indicators, Glassnode monitors shifts in new wallet address momentum. The crypto analytics firm interprets when the 30-day simple moving average (SMA) of new addresses rises above the 365-day SMA as a bullish signal. “Sustained periods of this condition (30-day SMA above the 365-day SMA) are typical of improving network fundamentals, and growing utilization”, they explain. Finally, the number of Bitcoin wallet addresses holding a non-zero BTC balance recently hit new record highs above 44 million for the first time.", 
       "image":"https://v2.cimg.co/news/105610/258337/responsive-images/bitcoin___media_library_original_4500_3000.jpeg",
       "date":"18 Feb 2023 20:46 GMT+3"
    }
]